/***********************************************************************
 *   头文件<string.h>                                                  * 
 *   该函数判断string是否以ch开头，如果是则返回string，否则返回null        *
************************************************************************/
char* strchr(char* string, char ch);


/***********************************************************************
 *  头文件<string.h>                                                   *
 *  该函数与上相似，只不过判断string的结尾是否为ch，                      *
 *  调用该函数后，指针在string的结尾                                     *
 *  eg:                                                                *
 *      const char* base = "(abcdef)";                                 *
 *      const char* rprens = strrchr(base, ')');                       *
 *      int length = rprens - base; //7,                               *
 *  获取的是base所占的空间                                               *
*************************************************************************/
char* strrchr(char* string, char ch);


